real_runs/small/cpu_64/long_conversation/logs/bench_client.log
INFO 04-26 16:34:56 [__init__.py:216] Automatically detected platform cpu.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7f3515ddcee0>, seed=0, num_prompts=4, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, endpoint_type='openai', label=None, backend='vllm', base_url=None, host='127.0.0.1', port=18200, endpoint='/v1/completions', max_concurrency=2, model='Qwen/Qwen2.5-Coder-1.5B-Instruct', tokenizer='Qwen/Qwen2.5-Coder-1.5B-Instruct', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=['max_model_len=8192'], result_dir='/users/LH/inference/real_runs/small/cpu_64/long_conversation/results', result_filename='bench_serve.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name='small-cpu', lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 04-26 16:34:59 [datasets.py:517] Sampling input_len from [4096, 4096] and output_len from [256, 256]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 01:49 elapsed, 13988:52:12 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 2
100%|██████████| 4/4 [02:14<00:00, 33.60s/it]
============ Serving Benchmark Result ============
Successful requests:                     4         
Maximum request concurrency:             2         
Benchmark duration (s):                  134.38    
Total input tokens:                      16384     
Total generated tokens:                  1024      
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         7.62      
Total Token throughput (tok/s):          129.54    
---------------Time to First Token----------------
Mean TTFT (ms):                          5363.54   
Median TTFT (ms):                        6376.89   
P99 TTFT (ms):                           7854.53   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          241.64    
Median TPOT (ms):                        244.20    
P99 TPOT (ms):                           248.65    
---------------Inter-token Latency----------------
Mean ITL (ms):                           241.64    
Median ITL (ms):                         219.04    
P99 ITL (ms):                            307.11    
==================================================